cassandra_docs/cassandrda_tests/cassandra-stress_read_n=200000_no-warmup_-rate_threads=50
******************** Stress Settings ********************
Command:
  Type: read
  Count: 200,000
  No Warmup: true
  Consistency Level: LOCAL_ONE
  Target Uncertainty: not applicable
  Key Size (bytes): 10
  Counter Increment Distibution: add=fixed(1)
Rate:
  Auto: false
  Thread Count: 50
  OpsPer Sec: 0
Population:
  Distribution: Gaussian:  min=1,max=200000,mean=100000.500000,stdev=33333.166667
  Order: ARBITRARY
  Wrap: false
Insert:
  Revisits: Uniform:  min=1,max=1000000
  Visits: Fixed:  key=1
  Row Population Ratio: Ratio: divisor=1.000000;delegate=Fixed:  key=1
  Batch Type: not batching
Columns:
  Max Columns Per Key: 5
  Column Names: [C0, C1, C2, C3, C4]
  Comparator: AsciiType
  Timestamp: null
  Variable Column Count: false
  Slice: false
  Size Distribution: Fixed:  key=34
  Count Distribution: Fixed:  key=5
Errors:
  Ignore: false
  Tries: 10
Log:
  No Summary: false
  No Settings: false
  File: null
  Interval Millis: 1000
  Level: NORMAL
Mode:
  API: JAVA_DRIVER_NATIVE
  Connection Style: CQL_PREPARED
  CQL Version: CQL3
  Protocol Version: V4
  Username: null
  Password: null
  Auth Provide Class: null
  Max Pending Per Connection: 128
  Connections Per Host: 8
  Compression: NONE
Node:
  Nodes: [localhost]
  Is White List: false
  Datacenter: null
Schema:
  Keyspace: keyspace1
  Replication Strategy: org.apache.cassandra.locator.SimpleStrategy
  Replication Strategy Pptions: {replication_factor=1}
  Table Compression: null
  Table Compaction Strategy: null
  Table Compaction Strategy Options: {}
Transport:
  factory=org.apache.cassandra.thrift.TFramedTransportFactory; truststore=null; truststore-password=null; keystore=null; keystore-password=null; ssl-protocol=TLS; ssl-alg=SunX509; store-type=JKS; ssl-ciphers=TLS_RSA_WITH_AES_128_CBC_SHA,TLS_RSA_WITH_AES_256_CBC_SHA; 
Port:
  Native Port: 9042
  Thrift Port: 9160
  JMX Port: 7199
Send To Daemon:
  *not set*
Graph:
  File: null
  Revision: unknown
  Title: null
  Operation: READ
TokenRange:
  Wrap: false
  Split Factor: 1

Sleeping 2s...
Running READ with 50 threads for 200000 iteration
Connected to cluster: Test Cluster, max pending requests per connection 128, max connections per host 8
Datatacenter: datacenter1; Host: localhost/127.0.0.1; Rack: rack1
type       total ops,    op/s,    pk/s,   row/s,    mean,     med,     .95,     .99,    .999,     max,   time,   stderr, errors,  gc: #,  max ms,  sum ms,  sdv ms,      mb
total,          3289,    3289,    3289,    3289,     9.2,     6.2,    28.3,    50.1,    87.9,    88.9,    1.0,  0.00000,      0,      0,       0,       0,       0,       0
total,         10868,    7579,    7579,    7579,     6.3,     3.5,    20.9,    38.9,    62.5,    84.3,    2.0,  0.27762,      0,      1,      35,      35,       0,     203
total,         21697,   10829,   10829,   10829,     4.6,     2.6,    13.6,    33.9,    60.5,    68.0,    3.0,  0.24204,      0,      2,      38,      69,       4,     405
total,         32807,   11110,   11110,   11110,     4.5,     2.5,    13.0,    25.9,    75.2,    89.4,    4.0,  0.19131,      0,      1,      39,      39,       0,     203
total,         44054,   11247,   11247,   11247,     4.4,     2.2,    15.3,    25.5,    58.2,    75.4,    5.0,  0.15499,      0,      2,      41,      60,      11,     406
total,         58459,   14405,   14405,   14405,     3.5,     2.2,    10.6,    21.6,    44.3,    63.0,    6.0,  0.14412,      0,      1,      34,      34,       0,     202
total,         74683,   16224,   16224,   16224,     3.1,     2.3,     7.9,    17.1,    32.5,    50.0,    7.0,  0.13622,      0,      2,      24,      42,       3,     407
total,         93172,   18489,   18489,   18489,     2.7,     2.1,     5.7,    13.8,    24.8,    36.3,    8.0,  0.13170,      0,      3,      19,      55,       0,     610
total,        111148,   17976,   17976,   17976,     2.8,     2.2,     6.3,    13.7,    34.0,    38.5,    9.0,  0.12158,      0,      2,      22,      39,       3,     407
total,        124959,   13811,   13811,   13811,     3.6,     2.0,    11.3,    21.9,    78.2,    83.6,   10.0,  0.10871,      0,      1,      17,      17,       0,     203
total,        139886,   14927,   14927,   14927,     3.3,     2.0,    11.2,    22.0,    41.9,    53.9,   11.0,  0.09846,      0,      2,      21,      39,       2,     406
total,        158944,   19058,   19058,   19058,     2.6,     2.1,     5.4,    12.2,    24.1,    26.0,   12.0,  0.09350,      0,      3,      68,     101,      24,     797
total,        177961,   19017,   19017,   19017,     2.6,     2.1,     5.6,    12.2,    23.5,    26.9,   13.0,  0.08836,      0,      2,      16,      32,       0,     408
total,        198216,   20255,   20255,   20255,     2.5,     2.0,     5.2,    11.2,    23.3,    27.9,   14.0,  0.08478,      0,      2,      15,      30,       0,     408
total,        200000,   19955,   19955,   19955,     2.5,     2.0,     5.8,     9.6,    10.5,    11.1,   14.1,  0.08316,      0,      0,       0,       0,       0,       0


Results:
Op rate                   :   14,195 op/s  [READ: 14,195 op/s]
Partition rate            :   14,195 pk/s  [READ: 14,195 pk/s]
Row rate                  :   14,195 row/s [READ: 14,195 row/s]
Latency mean              :    3.4 ms [READ: 3.4 ms]
Latency median            :    2.2 ms [READ: 2.2 ms]
Latency 95th percentile   :   10.8 ms [READ: 10.8 ms]
Latency 99th percentile   :   22.0 ms [READ: 22.0 ms]
Latency 99.9th percentile :   52.8 ms [READ: 52.8 ms]
Latency max               :   89.4 ms [READ: 89.4 ms]
Total partitions          :    200,000 [READ: 200,000]
Total errors              :          0 [READ: 0]
Total GC count            : 24
Total GC memory           : 4.946 GiB
Total GC time             :    0.6 seconds
Avg GC time               :   24.7 ms
StdDev GC time            :   12.3 ms
Total operation time      : 00:00:14

END